from indic_sentence_tokenizer import sentence_tokenize

string_panjabi = '''ਪਰ ਦੋਵੇਂ ਭਾਈਚਾਰਿਆਂ ਵਿਚਕਾਰ ਤਰੇੜ ਪਹਿਲਾਂ ਤੋਂ ਜ਼ਿਆਦਾ ਗਹਿਰੀ ਹੁੰਦੀ ਦਿਖ ਰਹੀ ਹੈ, ਜਿਸ ਦੇ ਪਿੱਛੇ ਰੋਜ਼-ਰੋਜ਼ ਉਛਾਲੇ ਜਾਣ ਵਾਲੇ ਅਜਿਹੇ ਮੁੱਦੇ ਹਨ ਜਿਨ੍ਹਾਂ ਦਾ ਸਿੱਧਾ ਸਬੰਧ ਦੇਸ਼ ਦੇ ਮੁਸਲਮਾਨਾਂ ਨਾਲ ਹੈ। ਇੱਥੇ ਅਸੀਂ ਉਨ੍ਹਾਂ ਮੁੱਦਿਆਂ 'ਤੇ ਨਜ਼ਰ ਮਾਰ ਰਹੇ ਹਾਂ ਜੋ ਦਰਾੜ ਨੂੰ ਭਰਨ ਦੀ ਜਗ੍ਹਾ ਉਸ ਨੂੰ ਹੋਰ ਗਹਿਰਾ ਕਰਦੇ ਜਾ ਰਹੇ ਹਨ। ਅਜਿਹਾ ਨਹੀਂ ਹੈ ਕਿ ਇਹ ਸਾਰੇ ਬਿਆਨ ਕੇਵਲ ਸਿਆਸੀ ਤਬਕੇ ਤੋਂ ਆ ਰਹੇ ਹਨ, ਬਲਕਿ ਸਮਾਜ ਦੇ ਹਰ ਹਿੱਸੇ ਵਿੱਚੋਂ ਆ ਰਹੇ ਹਨ। ਸੋਸ਼ਲ ਮੀਡੀਆ 'ਤੇ, ਪਾਰਟੀਆਂ ਦੇ ਬੁਲਾਰਿਆਂ ਤੋਂ ਲੈ ਕੇ ਵੱਟਸਐਪ ਗਰੁੱਪ ਦੇ ਰਿਸ਼ਤੇਦਾਰਾਂ ਵਿਚਕਾਰ ਹਿੰਦੂ-ਮੁਸਲਮਾਨ ਤਕਰਾਰ ਨਾਲ ਜੁੜੇ ਮੁੱਦਿਆਂ 'ਤੇ ਬਹਿਸ ਅਤੇ ਵਿਵਾਦ ਲਗਾਤਾਰ ਜਾਰੀ ਹੈ। ਕਦੇ ਧਰਮ-ਸੰਸਦ ਦੇ ਨਾਮ 'ਤੇ, ਤਾਂ ਕਦੇ ਭੜਕਾਊ ਭਾਸ਼ਣ ਦੇ ਕੇ, ਕਦੇ ਮਾਸ ਦੀਆਂ ਦੁਕਾਨਾਂ ਨੂੰ ਲੈ ਕੇ, ਕਦੇ ਪਾਰਕ-ਮਾਲ ਵਿੱਚ ਨਮਾਜ਼ ਪੜ੍ਹਨ ਨੂੰ ਲੈ ਕੇ।'''
def test_tokenize_punjabi():
    res = sentence_tokenize.sentence_split(string_panjabi,lang='pa',delim_pat='auto')
    assert len(res) == 5

string_hindi = '''गोवा में हुए अखिल भारतीय हिंदू राष्ट्र अधिवेशन के आयोजक हिंदुत्व संगठन 'हिंदू जनजागृति समिति' ने कहा कि साल 2025 तक हिंदू राष्ट्र की स्थापना हो जाएगी.

हिंदू राष्ट्र बनाने की कानूनी, सामाजिक पेचीदगियां तो एक तरफ़ है ही, इस मांग को आगे बढ़ाने में हिंदुत्ववादी संगठनों और नेताओं की महत्वपूर्ण भूमिका भी रही है. इन संगठनों की संख्या पिछले सालों में बढ़ी है. लेकिन कितनी बढ़ी है, इस बारे में आंकड़े उपलब्ध नहीं हैं.

इन गुटों की कोशिश रहती है कि वो अपनी नियमित गतिविधियों, विवादित और सांप्रदायिक भाषणों से आम हिंदुओं के बीच ख़ुद को प्रासंगिक बनाए रखें. उन्हें पता है कि ज़्यादा से ज़्यादा लोगों तक अपनी बात पहुँचाने के लिए सोशल मीडिया चैनलों का इस्तेमाल कैसे किया जाए और मीडिया में कैसे प्राइम टाइम पर पकड़ बनाई जाए.

कई हलकों में इन्हें 'फ़्रिंज गुट' और 'शैडो आर्मी' कहा जाता है, जिनके असर सीमित हैं, लेकिन एक दूसरी सोच ये है कि ये गुट फ्रिंज यानी हाशिए पर नहीं बल्कि मुख्यधारा में हैं. समाज में धर्म के नाम पर कट्टरता को आगे बढ़ा रहे हैं. हिंदू समाज की सोच को बड़े तौर पर प्रभावित कर रहे हैं. हर धर्म के ऐसे कट्टर गुटों की भूमिका और काम करने का ढंग इसी तरह का होता है.'''

def test_tokenize_hindi():
    res = sentence_tokenize.sentence_split(string_hindi,lang='hi',delim_pat='auto')
    assert len(res) == 10